eafagerland/STM32F2xx-Scratch/rtos/src/os_kernel.c
/********************************************************************************************
 *  @file   : os_kernel.c
 *  @author : Erik Fagerland
 *  @date   : 07/06/2024
 *
 *  @brief
 *  Implementation of RTOS Kernel with Thread shceduler
 *
 *******************************************************************************************/
#include "os_kernel.h"
#include "stm32f2xx_esl_systick.h"
#include "stm32f2xx_esl_nvic.h"
#include "stm32f2xx_esl_rcc.h"
#include "os_idle_thread.h"

#define RTOS_TICKRATE_HZ    (1000UL)

#define INTCTRL             (*((volatile UInt32 *)0xE000ED04))
#define PENDSTSET           (1U << 26U)

static UInt32 MILLIS_PRESCALER;

volatile UInt32 thread_count = 0;
volatile UInt32 systick_count = 0;

tcb_type *thread_array = NULL;
tcb_type *current_pt = NULL;

static Int32 **TCB_STACK = NULL;

// Function Prototypes
extern void os_scheduler_launch(void);
void os_scheduler_round_robin(void);

/********************************************************************************************
 *  Creates a new thread in HEAP memory
 *******************************************************************************************/
UInt8 os_kernel_new_thread(void(*task)(void), UInt16 stack_size, OS_Thread_Priority priority)
{
    __disable_irq();

    // Allocate memory for the thread array
    if (thread_array == NULL)
        thread_array = (tcb_type *)allocate((thread_count + 1) * sizeof(tcb_type));
    else
        thread_array = (tcb_type *)relocate(thread_array, (thread_count + 1) * sizeof(tcb_type));

    if (thread_array == NULL)
    {
        __enable_irq();
        return 1;
    }

    // Allocate memory for number of threads pointers to Int32
    if (TCB_STACK == NULL) 
        TCB_STACK = (Int32 **)allocate((thread_count + 1) * sizeof(Int32 *));
    else
        TCB_STACK = (Int32 **)relocate(TCB_STACK, (thread_count + 1) * sizeof(Int32 *));

    if (TCB_STACK == NULL)
    {
        __enable_irq();
        return 1;
    }

    // Allocate memory for thread stack
    TCB_STACK[thread_count] = (Int32 *)allocate(stack_size * sizeof(Int32));
    if (TCB_STACK[thread_count] == NULL)
    {
        __enable_irq();
        return 1;
    }

    tcb_type *thread = &thread_array[thread_count];

    thread->priority = (UInt32)priority;
    thread->is_suspended = 0;
    thread->tick_wakeup = 0;
    thread->stack_pt = &TCB_STACK[thread_count][stack_size - 16];

    current_pt = &thread_array[0]; // Set the current thread pointer to first thread

    // Iterate all the threads to set the next thread address
    for (UInt32 i = 0; i < thread_count + 1; i++)
    {   
        if (i == thread_count)
            thread_array[i].next_pt = &thread_array[0]; // If last thread, set next_pt to first thread

        if (i != 0)
            thread_array[i - 1].next_pt = &thread_array[i]; // Set the previous thread's next_pt to this
    }

    TCB_STACK[thread_count][stack_size - 1] = (1U << 24U);      // Set bit21 (T-bit) in PSR to 1, to operate in Thumb mode
    TCB_STACK[thread_count][stack_size - 2] = (Int32)(task);    // Initialize program counter (PC)

    thread_count++;

    __enable_irq();

    return 0;
}

/********************************************************************************************
 *  Initializes the kernel
 *******************************************************************************************/
void os_kernel_init(void)
{
    thread_array = NULL;
    TCB_STACK = NULL;
    MILLIS_PRESCALER = (RCC_Clocks.SYSCLK / RTOS_TICKRATE_HZ);
    systick_count = 0;
    thread_count = 0;
    current_pt = NULL;

    os_idle_thread_init();
    os_mem_init();
}

/********************************************************************************************
 *  Launches the kernel
 *******************************************************************************************/
void os_kernel_launch(void)
{
	__disable_irq();
    // Reset systick
    SYSTICK->STK_CTRL = 0;

    // Clear systick current value register
    SYSTICK->STK_VAL = 0;

    // Load quanta
    SYSTICK->STK_LOAD = MILLIS_PRESCALER - 1;

    // Set systick to low priority
    ESL_NVIC_Set_Priority(SysTick_IRQn, 15);

    // Enable Systick, Tickint and set AHB clock
    SET_REG(SYSTICK->STK_CTRL, (SYSTICK_ENABLE | SYSTICK_TICKINT_ENABLE | SYSTICK_CLK_SRC_AHB));

    // Launch Scheduler
    os_scheduler_launch();
}

/********************************************************************************************
 *  Yields a thread, resets systick and trigger and interrupt
 *******************************************************************************************/
void os_thread_yield(void)
{
    // Clear SysTick current value register
    SYSTICK->STK_VAL = 0;

    // Trigger SysTick
    INTCTRL |= PENDSTSET;
}

/********************************************************************************************
 *  Delays a thread for given time
 *******************************************************************************************/
void os_task_delay(UInt32 delay_ms)
{
    current_pt->tick_wakeup = delay_ms;
    
    UInt32 start_tick = systick_count;
    while (systick_count - start_tick < delay_ms)
    ;
}

/********************************************************************************************
 *  Returns the systick count
 *******************************************************************************************/
UInt32 os_get_tick(void)
{
    return systick_count;
}

void os_idle_hook(void)
{
    __asm volatile ("wfi");
}
